{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "From Atozi",
	"language": "fr",
	"home_page_url": "https://example.com/",
	"feed_url": "https://example.com/feed/feed.json",
	"description": "Narrative design en analyses",
	"author": {
		"name": "Antonin Demeilliez",
		"url": "https://example.com/about-me/"
	},
	"items": [
		{
			"id": "https://example.com/blog/baladins1/",
			"url": "https://example.com/blog/baladins1/",
			"title": "Baladins: narration procédurale interdite",
			"content_html": "<p><a href=\"https://example.com/img/8qVI3WYhpb-1017.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/8qVI3WYhpb-1017.avif 1017w\"><source type=\"image/webp\" srcset=\"https://example.com/img/8qVI3WYhpb-1017.webp 1017w\"><img alt=\"key art du jeu Baladins\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/8qVI3WYhpb-1017.jpeg\" width=\"1017\" height=\"447\"></picture></a></p>\n<p><em>La narration procédurale paraît souvent être une solution rêvée pour concevoir des jeux narratifs systémiques : la création d'un système narratif complexe et intelligent permettrait théoriquement de créer des histoires à l'infini ! Cependant, au fil du développement de</em> Baladins, <em>nous nous sommes peu à peu éloignés de manière inconsciente de la narration procédurale pour revenir à une narration plus fixe, et c'était la bonne chose à faire. Mais alors, quel était le problème avec la narration procédurale ?</em></p>\n<h2 id=\"de-bonnes-intentions\" tabindex=\"-1\">De bonnes intentions <a class=\"header-anchor\" href=\"https://example.com/blog/baladins1/\">#</a></h2>\n<p><a href=\"https://store.steampowered.com/app/1866320/Baladins/\" target=\"blank\"><em>Baladins</em></a> a avant tout été pensé comme une expérience de jeu de rôle très allégée et rapide. Le nom de travail du projet était même &quot;<em>Fast Adventure</em>&quot;.   <strong>L'idée première était de proposer un système proche d'un jeu de plateau permettant de créer des histoires vivantes, interactives, toujours changeantes selon les parties des joueurs.</strong> Des amis pourraient s'inviter à venir vivre l'expérience complète d'un jeu de rôle le temps d'une heure. Nous voulions qu'on rejoue à <em>Fast Adventure</em> comme on rejoue à un bon jeu de société, en éprouvant ses mécaniques, en se laissant surprendre par ses possibilités narratives infinies. Les joueurs et joueuses auraient écrit leurs propres histoires et les auraient écrites ensemble.</p>\n<p>Nous avons d'abord imaginé des plateaux de jeux modulables, constitués de lieux génériques dans lesquels les personnages auraient pu effectuer des actions génériques (explorer un donjon, acheter de l'équipement chez le forgeron, se reposer à la taverne etc.). Dans ces lieux, des personnages leur auraient donné des quêtes, des prémices d'histoires, elles aussi relativement génériques, et dont le déroulement aurait pu être simplement infléchi par les actions des joueurs, le hasard des rencontres sur le plateau et les jets de dés.\nLe berger vous demande de retrouver son fils, vous le retrouvez perché en haut d'un arbre ou tombé dans une rivière, et une fois récupéré vous pouviez l'échanger contre votre vie sauve à des bandits croisés sur la route. <strong>L'idée était de construire des quêtes à partir de briques narratives et d'interactions avec des objets.</strong></p>\n<p><a href=\"https://example.com/img/AuRdsWpItD-1486.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/AuRdsWpItD-1486.avif 1486w\"><source type=\"image/webp\" srcset=\"https://example.com/img/AuRdsWpItD-1486.webp 1486w\"><source type=\"image/png\" srcset=\"https://example.com/img/AuRdsWpItD-1486.png 1486w\"><img alt=\"Extrait du document de pitch original de Fast Adventure. On y voit l'idée du plateau de jeu avec des lieux génériques.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/AuRdsWpItD-1486.jpeg\" width=\"1486\" height=\"728\"></picture></a></p>\n<p><em>Extrait du document de pitch original de Fast Adventure. On y voit l'idée du plateau de jeu avec des lieux génériques.</em></p>\n<p>Pour parfaire ce système, j'avais commencé à imaginer une idée rudimentaire selon laquelle <strong>chaque PNJ était une boîte fermée</strong>. Le PNJ n'aurait consenti à nous aider, à s'ouvrir, que si nous trouvions la clef pour cette boîte : un service à lui rendre, être méchant avec son ennemi, lui donner un objet qui lui plait, etc. Ainsi les PNJ auraient eu une liste de goûts et de relations, indiquant les objets ou types d'objets aimés ou non, les personnages aimés ou non. Les joueurs et joueuses, au fil de leurs parties auraient pu apprendre ces préférences : cet aubergiste aime les objets magiques, les lutins aiment la nourriture, ce magicien déteste les armes etc.</p>\n<p>Il ne reste que peu de choses de ces idées dans <em>Baladins</em>. Un système trop compliqué ? Pas assez fun ? Nous ne le saurons jamais, car il est resté au stade de documents de design. Nous avons vite dû repenser la narration du jeu car, si l'intention première était d'offrir des parties rapides, la seconde était <strong>d'offrir des parties rejouables</strong>. Et si un système comme celui-ci permet de rejouer et de toujours avoir de la nouveauté grâce aux différentes combinaisons d'événements, est-il suffisant pour donner <em>envie</em> de rejouer?</p>\n<h2 id=\"la-carte-aux-tresors\" tabindex=\"-1\">La carte aux trésors <a class=\"header-anchor\" href=\"https://example.com/blog/baladins1/\">#</a></h2>\n<p>Nous voulions absolument que les joueurs aient envie de rejouer à <em>Baladins</em>. <strong>Pour ce faire, notre stratégie a été de miser sur l'univers du jeu.</strong> Il nous fallait un univers attirant, avec du caractère. Cette solution s'est imposée à nous car nous avions à cœur de faire un réel travail de <em>world building</em> pour éviter de proposer aux joueurs une <em>fantasy</em> convenue et générique. De plus, l'idée d'un plateau de jeu procédural ajoutait une grande quantité de travail de programmation. <strong>Concevoir un système de narration procédurale tout en ayant un univers riche et travaillé faisait éclater le <em>scope</em> de notre projet</strong> : il aurait fallu concevoir et coder le système de génération des cartes, le placement des personnages, créer les banques de phrases, de quêtes, d'histoires, ainsi que le système pour faire fonctionner le tout, tester toutes ses possibilités et s'assurer que tout fonctionne. Il aurait fallu imaginer et écrire des milliers de morceaux d'histoire et le système pour les faire s'articuler plutôt que la cinquantaine de quêtes présentes finalement dans le jeu. Tout cela aurait demandé un temps et une énergie démesurés par rapport à notre budget et la taille de notre équipe. <strong>Imaginer des possibilités narratives infinies qui donnent le sentiment d'un univers cohérent, original et attrayant était donc hors de notre portée.</strong></p>\n<p>Les terrains de jeu ont donc été conçus en amont, avec des lieux reconnaissables et uniques. Adieu tavernes, donjons et forêts génériques. Les plateaux sont pensés et les lieux visitables sont intimement liés aux quêtes et aux histoires qu'on peut y vivre : le château est un centre administratif où vivent des pigeons voyageurs, les deux villes voisines se querellent au sujet de l'école de magie qu'elles revendiquent, les savonniers finissent de récurer leurs chaudrons avant leur fermeture hivernale, etc. <strong>L'univers de Gatherac est un monde écrit qu'on va explorer de partie en partie.</strong></p>\n<p><a href=\"https://example.com/img/hj8O6JoQgy-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/hj8O6JoQgy-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/hj8O6JoQgy-1920.webp 1920w\"><source type=\"image/png\" srcset=\"https://example.com/img/hj8O6JoQgy-1920.png 1920w\"><img alt=\"\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/hj8O6JoQgy-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<h2 id=\"donner-de-la-voix\" tabindex=\"-1\">Donner de la voix <a class=\"header-anchor\" href=\"https://example.com/blog/baladins1/\">#</a></h2>\n<p>Cette exploration ne serait rien sans les quêtes jouées et les personnages rencontrés. Si nous avons pris le parti de faire des personnages jouables sans nom, ni genre, ni véritable personnalité (quoique), nous avons tout de suite voulu <strong>que nos PNJ incarnent l'univers.</strong> Cet univers, que voulions fort et original, devait être peuplé de personnages attachants et pleins de caractère. Nous voulions que les joueurs aiment ces personnages, les reconnaissent, connaissent leurs noms, aient leur préféré, et cela a définitivement éloigné le jeu d'une approche systémique, car quand on veut donner du caractère à un personnage, on doit, il me semble, écrire ses dialogues avec soin. C'était pour nous la solution la plus évidente et la moins coûteuse.</p>\n<p>Utiliser un système de dialogue procédural nous aurait permis d'utiliser un nombre limité de phrases génériques pour simuler les interactions avec les personnages. Cependant, il m'était inconcevable de mettre dans la bouche de tous les PNJ les mêmes mots pour signifier leurs réactions. Comment se prendre d'affection pour le marchand de fromage s'il me parle avec le même ton que la puissante magicienne ? <strong>Comment croire à cet univers si ses habitants parlent tous avec le même vocabulaire neutre ?</strong> Si toutes les particularités de langage sont gommées au profit d'une langue générique ? Pour avoir ce résultat avec de la narration procédurale, il aurait fallu écrire des banques de phrases pour chaque personnage, dans lesquels nous serions venus piocher pour composer des dialogues selon les situations vécues en jeu. Un tel travail de fourmi nous aurait fait passer à côté de l'intérêt d'un système de dialogue procédural.</p>\n<p><a href=\"https://example.com/img/my70aFamEv-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/my70aFamEv-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/my70aFamEv-1920.webp 1920w\"><source type=\"image/png\" srcset=\"https://example.com/img/my70aFamEv-1920.png 1920w\"><img alt=\"\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/my70aFamEv-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<p>Chaque personnage a donc une manière différente de réagir aux objets qu'on lui donne et les quêtes débloquent des options de dialogue spécifiques, <strong>écrites à la main.</strong> Tant pis si les soixante-dix-sept PNJ du jeu n'ont pas tous une réplique pour répondre aux cent soixante-trois objets qu'on peut leur donner ! Quand ils parlent, ils parlent pour de bon, et je pense pouvoir dire que c'est avec une voix bien à eux.</p>\n<h2 id=\"chasser-le-dragon\" tabindex=\"-1\">Chasser le dragon <a class=\"header-anchor\" href=\"https://example.com/blog/baladins1/\">#</a></h2>\n<p>Nous avons donc un univers cohérent et spécifique prêt à être visité et revisité, habité de personnages ayant chacun leur voix, mais le dernier élément qui a fini de faire basculer <em>Baladins</em> (ou plutôt <em>Fast Adventure</em>) de la narration procédurale à de la narration écrite fut la volonté de proposer <strong>une histoire cohérente sur le temps long</strong>.</p>\n<p>Toujours dans cette volonté de rétention, il nous semblait nécessaire de proposer une histoire continue d'une partie à l'autre, même de manière ténue. C'est ainsi que nous avons finalement imaginé l'histoire du Coulobre, ce dragon mangeur de temps qu'on doit rassasier. En nous renvoyant dans le passé inlassablement à la fin de chaque partie, le Coulobre nous fait revivre les mêmes événements. <strong>Adieu les histoires procédurales recomposées à chaque fois</strong> : il nous fallait un univers cohérent, qui subsiste et qu'on puisse apprivoiser, une boucle temporelle après l'autre. Les quêtes sont ainsi conçues pour être jouées et rejouées, et la narration elle-même devient un espace d'exploration : <strong>un arbre dont on voudrait grimper toutes les branches</strong>.</p>\n<p><a href=\"https://example.com/img/e0pWnzcu6f-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/e0pWnzcu6f-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/e0pWnzcu6f-1920.webp 1920w\"><source type=\"image/png\" srcset=\"https://example.com/img/e0pWnzcu6f-1920.png 1920w\"><img alt=\"\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/e0pWnzcu6f-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<h2 id=\"la-narration-procedurale-interdite\" tabindex=\"-1\">La narration procédurale interdite <a class=\"header-anchor\" href=\"https://example.com/blog/baladins1/\">#</a></h2>\n<p>Cette tension entre une approche systémique et une approche écrite a créé des difficultés au début du projet, notamment car nous n'avions pas identifié ce problème, cette incompatibilité : certains d'entre nous imaginaient le jeu comme un pur système, d'autres le voyaient plus comme un espace narratif écrit. Finalement, <strong>c'est la volonté artistique qui a tranché à notre place</strong> : pour permettre de réunir les gens autour du jeu sur le temps long, pour que les joueurs aient envie de relancer notre jeu, nous avons misé sur la spécificité de l'univers, son originalité, son charme, et sur une histoire au long cours.</p>\n<p>Si cette volonté était consciente, notre manque d'expérience dans les jeux narratifs nous a empêchés de savoir tout de suite quels moyens utiliser pour rendre cette volonté en jeu. C'est instinctivement, au fil du développement des personnages et de leurs dialogues, que s'est dessiné un jeu écrit, éloigné des volontés systémiques originelles. Il reste encore quelques vestiges des premières réflexions : les personnages ont presque tous une ou plusieurs &quot;clefs&quot; pour les &quot;ouvrir&quot; aux baladins, ainsi qu'une ou plusieurs manières de les fermer complètement au dialogue. Les événements aléatoires rencontrés sur la carte sont étroitement liés à la complétion d'une ou plusieurs quêtes et les actions dans les lieux sont des moyens d'avoir une approche plus &quot;<em>gameplay</em>&quot;. Si le système n'a pas existé dans sa forme originelle, il a permis de poser les bases et la structure de l'univers et des quêtes. <strong>C'est en travaillant avec comme objectif des intentions d'expérience clairement affirmées que le jeu s'est révélé ne pas être vraiment systémique.</strong> Ce n'était pas un choix, plutôt quelque chose que nous avons constaté pendant la production, en prenant un pas de recul. Le tout-systémique n'aurait pas fonctionné pour <em>Baladins</em>.</p>\n<p><a href=\"https://example.com/img/MUxeRZlP69-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/MUxeRZlP69-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/MUxeRZlP69-1920.webp 1920w\"><source type=\"image/png\" srcset=\"https://example.com/img/MUxeRZlP69-1920.png 1920w\"><img alt=\"Le schéma des quêtes de Baladins\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/MUxeRZlP69-1920.jpeg\" width=\"1920\" height=\"768\"></picture></a>\n<em>Le schéma des quêtes de Baladins. Chaque PNJ a une ou plusieurs &quot;clefs&quot; pour les &quot;ouvrir&quot; aux baladins.</em></p>\n<p>Il existe pourtant des jeux à la narration procédurale qu'on relance volontiers et auquel on peut jouer des dizaines d'heures. On peut penser à des jeux comme <em>Dwarf Fortress</em>, <em>Sunless Sea</em> ou <em>Curious Expedition</em> dans lesquels les personnages n'ont pas de voix propre et dont l'histoire se forge au fil des péripéties du <em>gameplay</em>.  Mais, contrairement à <em>Baladins</em>, ces jeux présentent des systèmes de <em>gameplay</em> complexes. Le plaisir ludique vient des combats, de la navigation sur une mer plongée dans les ténèbres, de la gestion de son navire ou de sa forteresse. Dans <em>Baladins</em>, le <em>gameplay</em> <strong>est</strong> la narration : pas de combat, pas de gestion, et une construction de personnage réduite au minimum. <strong>Dans notre jeu, le plaisir ludique vient des rencontres, des dialogues, de l'expérimentation en donnant des objets à des personnages, de l'exploration des possibilités narratives.</strong> Voilà l'enseignement que j'ai pu tirer de mon travail sur <em>Baladins</em> : la narration procédurale n'a de sens que si elle vient s'adosser à un système de jeu fort, avec des boucles de <em>gameplay</em> captivantes.\n<strong>La narration procédurale n'est pas faite pour les jeux narratifs.</strong></p>\n<p>Si votre jeu est fondé sur la narration, il faut que ses dialogues, ses enjeux, ses péripéties, soient écrits de manière fixe. Il faut qu'il transmette votre voix, vos idées et celles de votre équipe, car c'est cela qui va le rendre original et attachant. Un narration procédurale, si elle est fonctionnelle d'un point de vue dramaturgique, manquera sûrement du supplément d'âme et de propos qu'on cherche dans une histoire écrite et pensée. Car il ne faut pas oublier que le propre du récit est d'avoir un début, un milieu et une fin : pourquoi vouloir à tout prix imaginer des histoires infinies ?</p>\n",
			"date_published": "2025-07-17T00:00:00Z"
		}
		,
		{
			"id": "https://example.com/blog/zizanie/",
			"url": "https://example.com/blog/zizanie/",
			"title": "La Zizanie : ma participation au #ConFi2025",
			"content_html": "<p><a href=\"https://example.com/img/QFcvhOcAyG-1701.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/QFcvhOcAyG-1701.avif 1701w\"><source type=\"image/webp\" srcset=\"https://example.com/img/QFcvhOcAyG-1701.webp 1701w\"><source type=\"image/png\" srcset=\"https://example.com/img/QFcvhOcAyG-1701.png 1701w\"><img alt=\"Illustration en pixel art. Une silhouette de zombie, de dos, au premier plan, se dirige vers une petite maison au fond.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/QFcvhOcAyG-1701.jpeg\" width=\"1701\" height=\"447\"></picture></a></p>\n<p>Chaque année se tient en ligne le grand <a href=\"https://www.fiction-interactive.fr/lancement-officiel-du-concours-2025/\" target=\"_blank\">Concours de Fiction Interactive</a> organisé par la communauté de fiction-interactive.fr, ou le <em>#ConFi</em> pour les intimes. Ce concours, encore confidentiel, reste néanmoins une institution dans le domaine des passionnés de jeux textuels et chaque année des auteurices nous gratifient de superbes propositions originales et personnelles.</p>\n<p>J'ai pu moi-même par le passé participer au concours : une première fois en 2022 avec <em>Les Androïdes</em>, une FI fleuve sur le danger des croyances, et en 2023 avec <em>Entre-Deux</em>, une histoire d'amour et de fantôme, <em>coming of age story</em> sur le fait de savoir abandonner son adolescence et grandir. J'ai eu la chance pour ces deux réalisations d'obtenir le prix d'excellence littéraire.</p>\n<p>Après une année de pause, je reviens avec <em>La Zizanie</em>, une FI moins verbeuse, plus axée sur le système que sur la prose. J'avais besoin d'expérimenter un peu plus sur la manière de faire des boucles de gameplay dans un jeu textuel. J'ai pu y réinvestir l'expérience acquise en travaillant sur <em>Baladins</em>, notamment pour écrire des réseaux de relations entre personnages et des pseudo-quêtes basées sur la connaissance de ces relations.</p>\n<p>La Zizanie se présente comme un <em>mini-knowledgevania</em> dans lequel vous devrez repousser une invasion de zombies. Comme j'ai déjà pu le faire dans <em>Les Androïdes</em>, je questionne la figure de personnage principal, en vous faisant incarner tous les villageois un par un si ces derniers viennent à mourir. L'idée est de montrer que l'effort collectif prime quand il s'agit de repousser une menace, et qu'on ne peux compter sur un héros solitaire.  À l'instar des <em>Androïdes</em> , ce récit est une métaphore politique, mais je ne vous en dit pas plus pour vous laisser le plaisir de la découvrir.</p>\n<p>Vous pouvez <a href=\"https://atozi.itch.io/la-zizanie\" target=\"_blank\">jouer à <em>La Zizanie</em> sur ma page itch</a> et me laisser un commentaire, je serai ravi de savoir comment vous vous en êtes sortis !</p>\n<p>N'hésitez pas à aussi donner leur chance aux <a href=\"https://itch.io/jam/concours-de-fiction-interactive-francophone-2025/entries\" target=\"_blank\">autres participations de cette année</a>, elles sont pleines d'idées originales et d'histoires personnelles encore trop rares dans le jeu vidéo commercial. Vous pouvez aussi noter les FI via <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdfhiMxR8roXJNoqdkh73MtA39yTK0vtiWRONrtTvtQI6JqnQ/viewform\" target=\"_blank\">ce formulaire</a> pour aider à décerner les différents prix ! Vous pourrez aussi me voir streamer quelques jeux si vous surveillez <a href=\"https://www.twitch.tv/atozi_\" target=\"_blank\">ma page twitch</a>.</p>\n",
			"date_published": "2025-03-12T00:00:00Z"
		}
		,
		{
			"id": "https://example.com/blog/frog/",
			"url": "https://example.com/blog/frog/",
			"title": "Frog Detective : la chaîne de clefs",
			"content_html": "<p><a href=\"https://example.com/img/OzA_niMUsW-1017.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/OzA_niMUsW-1017.avif 1017w\"><source type=\"image/webp\" srcset=\"https://example.com/img/OzA_niMUsW-1017.webp 1017w\"><img alt=\"Un screenshot de Frog Detective 2. On y voit des photos de chiens détourés sur un fond de village en 3D.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/OzA_niMUsW-1017.jpeg\" width=\"1017\" height=\"447\"></picture></a></p>\n<p><em><strong>Le genre du jeu d'enquête est foisonnant ces dernières années. Parmi eux, la série des</strong></em> <strong>Frog Detective</strong>, <em><strong>malgré ses atours enfantins et apparemment simplistes, nous donne véritablement le sentiment de mener l'enquête. Comment fait-il ? Mettons un coup de loupe sur le deuxième épisode :</strong></em> <strong>Frog Detective 2 - L'Affaire de la sorcière invisible.</strong></p>\n<h2 id=\"la-grenouille-a-la-langue-bien-pendue\" tabindex=\"-1\">La grenouille à la langue bien pendue <a class=\"header-anchor\" href=\"https://example.com/blog/frog/\">#</a></h2>\n<p>Faire incarner un enquêteur est souvent un véritable <a href=\"https://www.youtube.com/watch?v=gwV_mA2cv_0\" target=\"_blank\">casse-tête de design</a> : comment donner le sentiment de déduire par soi-même la solution d'un mystère dans un système aussi déterministe et limité qu'un jeu vidéo ? Des jeux aujourd'hui célèbres y sont allés de leurs solutions ingénieuses : on s'est pâmé devant <em>The Return of the Obra Dinn</em>, on s'est creusé la tête sur <em>The Case of the Golden Idol</em> et on s'est émerveillé devant la proposition qu'était <em>Her Story</em>. Dans ce paysage de jeux bien sérieux, la série des <em>Frog Detective</em> (worm club, 2018 – 2022)  fait figure d'exception avec son ton léger et son humour absurde. Pourtant, ne nous arrêtons pas aux apparences, car derrière ces masque de bêtise bon enfant se cache une mécanique bien huilée et un design précis.</p>\n<p>Dans le petit village de la Lisière aux Sorcières, la fête donnée en l'honneur de la nouvelle habitante a été sabotée ! Par qui ? Pourquoi ? Voilà bien un mystère pour Détective Grenouille !</p>\n<p><a href=\"https://example.com/img/UlRB2UVYxZ-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/UlRB2UVYxZ-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/UlRB2UVYxZ-1920.webp 1920w\"><img alt=\"Un screenshot de Frog Detective 2. Un pingouin dit au téléphone: Veillez à interroger tous les habitants pour démêler cette intrigue complexe.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/UlRB2UVYxZ-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<p>Son mode opératoire est simple. Dans la droite lignée des Maigret et autres Colombo, Grenouille bat le pavé et va à la rencontre des habitants, loupe en main. La vérité naîtra des interrogatoires détaillés que l'on peut mener avec un ensemble de PNJ tous plus hauts en couleur les uns que les autres. En termes de gameplay, cela se traduit par un système de dialogue rudimentaire qui nous permettra de poser environ deux questions à nos suspects.</p>\n<p>Les réponses à nos questions nous apprendront deux choses essentielles : du contexte (quelques informations sur la vie du village, les rapports entre habitants et parfois des indices sur les événements de la veille) mais aussi ce que veulent les personnages, et c'est en réalité plus important que leurs témoignages incertains.</p>\n<h2 id=\"alohomora\" tabindex=\"-1\">Alohomora ! <a class=\"header-anchor\" href=\"https://example.com/blog/frog/\">#</a></h2>\n<p>Dans ce village de sorcières, tout le monde veut quelque chose et il sera nécessaire à Détective Grenouille de l'apprendre. Nous sommes ici devant un cas évident de design en &quot;clefs et serrures&quot;. Chaque personnage cherche un objet &quot;clef&quot; et lui donner permet d'ouvrir sa &quot;serrure&quot;. Toute la subtilité du jeu tient dans le fait que la récompense pour avoir ouvert la serrure d'un PNJ est… La clef d'un autre personnage !</p>\n<p>Par exemple, Victor le cerf a faim, je lui apporte une quiche fraîche, et il m'offre un chapeau pointu en retour. Coup de bol, Carlos le Zèbre avait besoin d'un chapeau pointu ! Si je lui donne, il m'offre un tapis que je peux offrir à… Je m'arrête là avant de spoiler tout le jeu, vous comprenez l'idée.</p>\n<p><a href=\"https://example.com/img/QxP3lV7w3H-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/QxP3lV7w3H-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/QxP3lV7w3H-1920.webp 1920w\"><img alt=\"Un screenshot de Frog Detective 2. On y voit Noddy qui dit : Si seulement j'avais un tapis pour cacher les saletés.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/QxP3lV7w3H-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<p>Le principe du jeu sera non seulement d'essayer de comprendre qui veut quoi et qui peut me donner quoi, mais surtout d'essayer de remonter cette <strong>chaîne de clefs et serrures</strong> pour en trouver l'origine. Cette structure opère une métaphore : comme un détective, on cherche à remonter le fil des événements, l'enchaînement de causalité qui devrait nous mener jusqu'au coupable. On ne réfléchit pas littéralement à l'affaire, mais le sentiment de chercher pour retourner à l'origine des choses est bien là.</p>\n<h2 id=\"alimentaire-mon-cher-watson\" tabindex=\"-1\">Alimentaire, mon cher Watson <a class=\"header-anchor\" href=\"https://example.com/blog/frog/\">#</a></h2>\n<p>Mais, vous me demanderez : si la clef de chaque personnage est donnée par son voisin, qui nous donne la clef du premier maillon de la chaîne ? Je vois bien là votre esprit affuté de détective à l'œuvre. Effectivement la clef du premier maillon de la chaîne nous vient par l'autre approche du métier d'enquêteur : la collecte d'indices.</p>\n<p><a href=\"https://example.com/img/knujex8Iv3-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/knujex8Iv3-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/knujex8Iv3-1920.webp 1920w\"><img alt=\"Un screenshot de Frog Detective 2. On y voit une quiche au sol. Détective dit : Une mini quiche&nbsp;? Bizarre. Je vais la prendre avec moi.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/knujex8Iv3-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<p>Toute bonne enquête commence par la récolte d'indices sur la scène de crime ! <em>Frog Detective 2</em> ne déroge pas à la règle, ou alors si peu. En effet, s'il ne récolte pas des indices à proprement parler, Détective Grenouille devra tout de même retrouver les cinq quiches perdues de Mandy. En termes de gameplay, il faudra donc littéralement fouiller le petit environnement que représente le village à la recherche des précieux objets (à noter que la cinquième quiche n'apparaît que quand Mandy vous a fait part du problème, ce qui empêche de toutes les trouver avant de savoir pourquoi on les ramasse).\nLà encore, par le biais de la parodie, le jeu crée une métaphore qui fait apparaître le sentiment de mener l'enquête : on scrute le moindre recoin, on cherche, on fouille, pour être certain de ne rien manquer.</p>\n<h2 id=\"structure-et-sentiments\" tabindex=\"-1\">Structure et sentiments <a class=\"header-anchor\" href=\"https://example.com/blog/frog/\">#</a></h2>\n<p>Avec des moyens rudimentaires, peu de features et un design narratif très simple, <em>Frog Detective</em> ne nous fait pas littéralement mener une enquête. On ne trouve pas d'indices à interpréter, on ne fait pas de réelle déduction, on ne confond pas un témoin peu fiable ou un suspect menteur. Non, par sa structure, le jeu nous donne seulement <em>le sentiment</em> de mener l'enquête : on cherche des objets, on interroge les suspects, et on essaie de tout remettre dans le bon ordre. Ainsi, on voit bien qu'une bonne structure narrative peut donner un sentiment précis et que c'est un outil très puissant. Un jeu n'a pas besoin d'une structure complexe, il a besoin de la structure adaptée, et c'est tout à fait le cas dans les jeux de la série <em>Frog Detective</em>. Tant pis si les systèmes de jeux ne simulent pas réellement le travail d'investigation car, finalement, pourquoi joue-t-on à un jeu, si ce n'est pour les sentiments qu'il nous fait éprouver ?</p>\n<p><a href=\"https://example.com/img/KiBn895gJw-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/KiBn895gJw-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/KiBn895gJw-1920.webp 1920w\"><img alt=\"Un screenshot de Frog Detective 2. On y voit Détective Grenouille qui dit : Les mystères n'ont qu'à bien se tenir&nbsp;!\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/KiBn895gJw-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n",
			"date_published": "2024-09-27T00:00:00Z"
		}
		,
		{
			"id": "https://example.com/blog/firebird/",
			"url": "https://example.com/blog/firebird/",
			"title": "Firebird : le cerbère de la porte",
			"content_html": "<p><a href=\"https://example.com/img/RX6mAnbUFx-1017.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/RX6mAnbUFx-1017.avif 1017w\"><source type=\"image/webp\" srcset=\"https://example.com/img/RX6mAnbUFx-1017.webp 1017w\"><img alt=\"Mariska attaquée par un ours.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/RX6mAnbUFx-1017.jpeg\" width=\"1017\" height=\"446\"></picture></a>\n<strong>À avancer tête baissée, on peut finir dans le mur. C'est la leçon que nous enseigne Firebird du studio Ludogram. Comment le jeu fait-il pour imposer son rythme et nous pousser à lever le pied de l'accélérateur ? Avec un bon chien de garde !</strong></p>\n<h2 id=\"mot-de-passe\" tabindex=\"-1\">Mot de passe ? <a class=\"header-anchor\" href=\"https://example.com/blog/firebird/\">#</a></h2>\n<p>Le <em>narrative design</em> est souvent une histoire de clefs et de portes. Les jeux sont rythmés par des portes dont il faut trouver la ou les clefs pour progresser. Parfois il s'agit de portes bien concrètes fermées à clef, ou par des fragments de clefs, ou par un code noté sur un post-it dans le bureau voisin. Parfois, il s'agit de portes plus abstraites : tuer tous les ennemis d'une zone, trouver la bonne option de dialogue, le bon objet à donner à quelqu'un, rendre un service pour qu'un PNJ se confie à vous… Cette notion de clefs et de portes permet de donner des objectifs clairs et des récompenses satisfaisantes : j'ai trouvé la clef, la porte s'ouvre, je progresse dans le jeu et dans l'histoire.</p>\n<p><em>Firebird</em>, écrit par Fibretigre et publié par le studio Ludogram, ne déroge pas à la règle. On y incarne Mariska, une camionneuse russe lancée sur les routes de Sibérie pour ramener une jeune fille chez elle, loin au nord.  Au volant de son camion, il lui faudra déjouer les pièges d'une terre hostile, échapper aux fantômes de l'URSS, et surtout, et c'est là un des piliers du <em>gameplay</em> : gérer l'intégrité de son camion et ses réserves de carburant, car dans les forêts de Sibérie, la panne d'essence est question de vie ou de mort.</p>\n<p><a href=\"https://example.com/img/fPrssxwDog-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/fPrssxwDog-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/fPrssxwDog-1920.webp 1920w\"><img alt=\"L'écran de voyage de Firebird. Un encart indique : Vos réserves d'essence baissent de 1.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/fPrssxwDog-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<p>En effet, si l'on reprend la route avec un réservoir vide, nos personnages courent à une fin funeste, et c'est le <em>game over</em> assuré. En termes de structure de jeu, on peut considérer chaque route comme une porte et l'essence comme la clef pour l'ouvrir. Si on n'a pas la clef, c'est la fin du jeu et on nous renvoie au dernier lieu visité. Ce fonctionnement renvoie à une structure <em>one true path</em>, où prendre le mauvais chemin mène au <em>game over</em>, mais contrairement à cette structure punitive, les routes ne sont mauvaises que si l'on n'a pas la clef pour ouvrir la porte. Je propose de donner à cette structure le nom de « <strong>cerbère de la porte</strong> ». Si on se présente à la porte sans avoir sur nous la bonne clef, le gardien (abstrait) nous terrasse et c'est la fin du parcours. Mais si, comme dans la légende d'Orphée aux enfers (ou d'<em>Harry Potter à l'école des sorciers</em>), on se présente face au cerbère avec de la musique, le chemin s'ouvre devant nous et l'aventure continue.</p>\n<p><a href=\"https://example.com/img/6lvwf1Pfqn-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/6lvwf1Pfqn-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/6lvwf1Pfqn-1920.webp 1920w\"><img alt=\"Un écran de game over.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/6lvwf1Pfqn-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<h2 id=\"prudence-est-mere-d-exploration\" tabindex=\"-1\">Prudence est mère d'exploration <a class=\"header-anchor\" href=\"https://example.com/blog/firebird/\">#</a></h2>\n<p>Cette structure a plusieurs vertus. La première est de nous motiver à bien explorer les lieux visités. On doit fouiller les maisons et les églises abandonnées ou négocier avec les locaux pour s'assurer qu'on a toujours bien assez de carburant pour reprendre la route. Cette menace de la panne d'essence est donc un moteur d'exploration. Elle nous pousse à aller nous confronter aux scènes à choix multiples du jeu, à explorer les embranchements narratifs et ainsi ne pas passer à côté de précieuses ressources. Il n'est pas question de traverser les différents arrêts sur le chemin tête baissée pour aller à la fin le plus vite possible. Le cerbère de la porte impose son rythme : il faut prendre le temps de bien fouiller, de faire tout ce que l'on peut faire, et bien lire tous les mots de l'auteur.</p>\n<p>La deuxième vertu est de poser une contrainte de <em>gameplay</em> en corrélation directe avec le récit. Une forte tension se crée au moment où l'on est à court de carburant. On sait que trouver de l'essence rapidement devient une nécessité absolue. Imaginez alors l'émotion quand on doit explorer un village abandonné à la recherche d'hydrocarbures et qu'une meute de loups approche ! On n'a d'autre choix que de s'attarder et affronter les bêtes affamées, car reprendre la route avec un réservoir vide est synonyme de mort.</p>\n<p><a href=\"https://example.com/img/mvYpmsHX1T-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/mvYpmsHX1T-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/mvYpmsHX1T-1920.webp 1920w\"><img alt=\"Mariska et Vassilissa ont l'air inquiet. Le narrateur dit : Vous entendez des loups hurler en meute.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/mvYpmsHX1T-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<h2 id=\"qui-tire-les-ficelles\" tabindex=\"-1\">Qui tire les ficelles ? <a class=\"header-anchor\" href=\"https://example.com/blog/firebird/\">#</a></h2>\n<p>Mais ce design basé sur des ressources est-elle si honnête ? En rejouant au jeu pour vérifier ma théorie, j'ai compris que la route que je prenais ne me permettait pas de trouver de l'essence avant la scène de ma rencontre avec les loups. Chaque route empruntée auparavant retirait un point à ma jauge de carburant, me menant inéluctablement vers le moment fatidique de la panne.  On nous fait croire en ce début de jeu que l'on doit gérer nos ressources, or il n'en est rien : l'essence n'est qu'un compte à rebours jusqu'à cette scène de grand péril.</p>\n<p>Comme dans un bon <em>survival</em>, la tension narrative nait de la pénurie, et cette tension est maîtrisée par l'auteur. Avoir la main sur la distribution des ressources le dote d'un outil très puissant pour susciter des émotions. Ne distribuez plus de ressources, vous provoquerez une grande détresse ; donnez-en beaucoup d'un coup et vous provoquerez le soulagement et la joie.</p>\n<h2 id=\"chien-fidele\" tabindex=\"-1\">Chien fidèle <a class=\"header-anchor\" href=\"https://example.com/blog/firebird/\">#</a></h2>\n<p>Le cerbère de la porte est un véritable outil de <em>narrative design</em> dans la mesure où il convoque à la fois <em>gameplay</em> et narration et les fait s'imbriquer, tant pour offrir une boucle de progression claire qu'une manière de pimenter les péripéties narratives. La vraie force de cet outil se révèle quand il constitue la base de la structure complète du jeu : <em>Firebird</em>, en utilisant cette mécanique à chaque étape du voyage, établit clairement la dangerosité de ce dernier. Le contrat de jeu devient clair avec les joueurs et joueuses, et il est bien compris que le cerbère de la porte sera là, comme une épée de Damoclès, à nous surveiller. Le jeu y trouve alors naturellement un objectif clair et toujours renouvelé : trouver une nouvelle musique pour endormir le cerbère.</p>\n",
			"date_published": "2024-03-22T00:00:00Z"
		}
		,
		{
			"id": "https://example.com/blog/planescape/planescape-torment/",
			"url": "https://example.com/blog/planescape/planescape-torment/",
			"title": "Planescape Torment : La boîte de skinner narrative",
			"content_html": "<p><a href=\"https://example.com/img/1FZMZ0ZNrU-1017.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/1FZMZ0ZNrU-1017.avif 1017w\"><source type=\"image/webp\" srcset=\"https://example.com/img/1FZMZ0ZNrU-1017.webp 1017w\"><img alt=\"Un screenshot de Planescape Torment. On y voit le héros allongé sur un billaud dans un environnement glauque.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/1FZMZ0ZNrU-1017.jpeg\" width=\"1017\" height=\"446\"></picture></a></p>\n<p><strong>Encensé en son temps pour son écriture, que peut-on retenir aujourd'hui de la narration de <em>Planescape Torment</em> ? Disséquons ensemble son introduction et voyons comment le jeu fait de nous son sujet d'expérience.</strong></p>\n<h2 id=\"motiver-l-exploration\" tabindex=\"-1\">Motiver l'exploration <a class=\"header-anchor\" href=\"https://example.com/blog/planescape/planescape-torment/\">#</a></h2>\n<p>Notre héros, Sans-Nom, s'éveille dans une morgue à côté d'un crâne bavard. Amnésique, il ne sait ni où ni qui il est, tout comme le joueur qui l'incarne. Ce procédé narratif, bien qu'éculé, est redoutablement efficace pour attiser la curiosité. Ces mystères sont autant de questions qui trouveront des réponses tout au long de l'aventure, et on comprend vite que notre survie en dépendra.</p>\n<p>Morte, le crâne à nos côtés, nous donne déjà nos premiers objectifs : retrouver un journal qui nous a été dérobé et nous échapper de cette morgue. Pour ce faire, la première étape va consister à trouver une arme quelque part et récupérer la clef d'un des gardes zombis. Ainsi, on nous apprend en premier lieu à fouiller les coffres et les meubles, une mécanique fondamentale à tout jeu de rôle où le sacro-saint <em>loot</em> est bien souvent la motivation première. Nous voilà donc armés et déjà motivés à accomplir notre quête d'identité, même si cela implique de poignarder des zombis avec un scalpel rouillé.</p>\n<h2 id=\"parler-avant-de-taper\" tabindex=\"-1\">Parler avant de taper <a class=\"header-anchor\" href=\"https://example.com/blog/planescape/planescape-torment/\">#</a></h2>\n<p>Trois zombis errent dans la pièce. À leur approche, on peut déjà remarquer une étrangeté : ils ne nous attaquent pas. Si on les survole avec notre curseur, c'est une bulle de dialogue qui apparaît : on nous propose de leur parler avant d'attaquer. C'est loin d'être une évidence dans les jeux de rôles, et encore moins dans les jeux vidéo en général. Après avoir fouillé, notre deuxième action peut être de parler avec ceux-là même qu'on nous enjoint à suriner.</p>\n<p>Si l'on entame la conversation avec ces zombis, le jeu nous les décrit et nous propose de leur parler – bien qu'ils soient peu loquaces – ou de les <strong>observer</strong> en détail pour découvrir lequel des trois zombis possède la clef tant convoitée. Invariablement, les négociations s'avèreront infructueuses et attaquer le zombi sera notre seule solution pour récupérer le précieux sésame.</p>\n<p><a href=\"https://example.com/img/Ra0xVJZes4-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/Ra0xVJZes4-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/Ra0xVJZes4-1920.webp 1920w\"><img alt=\"Dialogue avec un zombi qui commence par une description de ce dernier «Ce cadavre doit être celui qui possède la clé. Il la tient serrée dans sa main gauche, le pouce et l'index comme figés autour.» Une option de dialogue propose de lui dire «J'ai besoin de cette clé, cadavre... On dirait bien que tu ne vas pas faire long feu dans ce monde.»\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/Ra0xVJZes4-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<p>En <em>game design</em>, on s'intéresse aux verbes d'action à la disposition de notre personnage pour interagir avec son environnement. Le début de cette aventure nous présente les verbes d'action fondamentaux : fouiller, parler, attaquer. Par l'ordre avec lequel ils sont présentés dans <em>Planescape Torment</em>, la violence apparaît plus comme un dernier recours qu'une option par défaut, et plus encore, on peut voir que le verbe « parler » nous ouvre souvent d'autres verbes (observer en l'occurrence, mais il y en aura bien plus durant l'aventure). Pour qui cherche la variété d'approches, l'action « parler » semble privilégiée.</p>\n<h2 id=\"y-en-a-dans-la-caboche\" tabindex=\"-1\">Y en a dans la caboche <a class=\"header-anchor\" href=\"https://example.com/blog/planescape/planescape-torment/\">#</a></h2>\n<p>La porte est ouverte, on arpente un défilé de couloirs peuplés de zombis affairés à disséquer des cadavres. Un peu plus loin, on découvre une tieffeline en pleine autopsie. Elle nous somme de lui apporter du fil et une lotion d'embaumement. Voilà enfin une quête qui sent bon le jeu de rôle, avec un objet à trouver et mettre à profit les verbes d'action que l'on a déjà appris ! Si l'on trouve rapidement de la lotion d'embaumement en fouillant les étagères de la pièce voisine, pour trouver du fil est une aiguille, le meilleur moyen est de… Parler à l'un des zombis ayant la bouche cousue ! Le jeu nous propose alors de <strong>découdre</strong> le fil avec notre scalpel pour l'empocher et valider la quête. Encore une fois, parler est une porte vers un autre verbe.</p>\n<p>Ainsi on apprend que parler aux gens nous permet de récupérer des objets, et l'on peut tenter notre chance avec d'autres zombis si on ne l'avait pas déjà fait. On pourra récupérer des documents des mains d'un bibliothécaire mort-vivant, une missive dans le crâne d'un squelette messager, ou encore un bras sur un corps effondré…  Les personnages dans ce premier donjon fonctionnent en réalité <strong>presque comme des coffres</strong> qu'on va fouiller. On y trouve du butin pour récompenser notre curiosité. Se crée ainsi une boucle de gameplay basée sur la discussion et non le combat comme c'est habituellement le cas dans le genre.</p>\n<h2 id=\"oui-mais-pas-tout-le-temps\" tabindex=\"-1\">Oui, mais pas tout le temps ! <a class=\"header-anchor\" href=\"https://example.com/blog/planescape/planescape-torment/\">#</a></h2>\n<p><a href=\"https://example.com/img/8YGpw-uF7m-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/8YGpw-uF7m-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/8YGpw-uF7m-1920.webp 1920w\"><img alt=\"Un dialogue de Planescape Torment où l'on nous permet de ramasser le bras coupé d'un cadavre qui s'est effondré.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/8YGpw-uF7m-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<p>Une fois cette réalisation faite, on est motivé à parler à tout ce qui claudique dans la morgue en faisant bien attention à ne pas éveiller l'attention des Hommes-Poussière (avec qui on peut aussi parlementer pour s'en sortir). Or, si on est parfois récompensé, bien souvent les zombis n'ont pas grand chose à nous dire ni à nous offrir. Après une brève description de notre interlocuteur, la conversation tourne court. Frustrant ? Oui, parfois. Motivant ? Assurément.</p>\n<p>Le fait d'intégrer un facteur d'incertitude dans la discussion avec les zombis augmente notre envie de tous leur parler. Le sentiment de surprise, le sentiment de <strong>fouiller, explorer</strong> et pas seulement <strong>consulter</strong> ce qu'on met à notre disposition vient de ce que <strong>les trésors sont cachés dans une multitude de coffres vides</strong>, au sens propre comme au sens figuré.</p>\n<p>Cela rappelle quelque peu l'expérience de Burrhus Skinner sur des pigeons. Le psychologue avait remarqué que si on donne à un pigeon un bouton qui lui distribue de la nourriture, il s'en lassera quand il n'en aura plus besoin. <strong>En introduisant une part d'incertitude sur la distribution, le pigeon se met à appuyer frénétiquement sur le bouton pour s'assurer d'avoir de la nourriture.</strong> Cette mécanique bien connue est appliquée dans les jeux de rôle. Il est incertain de trouver du butin sur les ennemis que l'on tue, mais on pourra piller sur certains d'entre eux un véritable trésor. En appliquant cette mécanique aux dialogues, on motive les joueurs et joueuses à parler à un maximum de personnages. Parfois cela ne donnera rien d'intéressant, parfois on trouvera un objet, parfois on aura une interaction inattendue, une micro-histoire comme celle de cet homme déguisé en zombi pour infiltrer la morgue.</p>\n<h2 id=\"conclusion\" tabindex=\"-1\">Conclusion <a class=\"header-anchor\" href=\"https://example.com/blog/planescape/planescape-torment/\">#</a></h2>\n<p>Au bout de quelques minutes dans cette boîte de Skinner, on est habitué à discuter pour avoir notre butin quotidien, notre plaisir de jeu. Est-on prisonnier de nos impulsions comme un pigeon dressé ? Peut-être, mais le jeu nous libère vite, après avoir établi son fonctionnement. En s'échappant de la morgue, on se retrouve dans les rues bondées de Sigil. Des centaines de passants discutent entre eux. Faut-il tous leur parler ? Si on essaie, on se confronte très vite à un mur. En quelques mots, on nous envoie paître de bien des manières, mais on ne gagne plus rien, pas d'objet, pas de petite histoire, pas même une petite description amusante. Après nous avoir fait comprendre qu'il faudrait parler pour évoluer dans ce monde et accomplir notre quête, le jeu casse la boîte de Skinner et nous permet de voler de nos propres ailes.</p>\n<p><a href=\"https://example.com/img/waBQr2a7FB-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/waBQr2a7FB-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/waBQr2a7FB-1920.webp 1920w\"><img alt=\"Un dialogue de Planescape Torment où un passant nous dit «J'sais rien qui pourrait t'aider, bige... Fiche-moi la paix.»\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/waBQr2a7FB-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n",
			"date_published": "2024-02-20T00:00:00Z"
		}
		,
		{
			"id": "https://example.com/blog/vampire/",
			"url": "https://example.com/blog/vampire/",
			"title": "Vampire Swansong : la belle catastrophe",
			"content_html": "<p><a href=\"https://example.com/img/ezrUc9-MqU-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/ezrUc9-MqU-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/ezrUc9-MqU-1920.webp 1920w\"><img alt=\"Un vampire devant un long couloir qui se termine par une porte sur laquelle figure le signe de la croix.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/ezrUc9-MqU-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<p><strong>On parlemente, on négocie, on essaie, on convainc, et finalement tout part en vrille et des têtes tombent. Il faudra vivre avec. Dans <em>Vampire: The Masquerade - Swansong</em>, échouer peut mener à la catastrophe mais réussir peut mener à… Une belle catastrophe !</strong></p>\n<h2 id=\"en-avant\" tabindex=\"-1\"><a id=\"back-note-1\"> En avant !</a> <a class=\"header-anchor\" href=\"https://example.com/blog/vampire/\">#</a></h2>\n<p>Les fictions interactives à embranchements comportent des structures qui peuvent facilement être schématisées. Quand elles ne tolèrent pas l’échec ou le mauvais choix, on parle traditionnellement de structure <em>one true path</em><a href=\"https://example.com/blog/vampire/\">¹</a> (comme dans les plus revêches des <em>Livres dont vous êtes le héros</em>). Dans ce cas, la moindre erreur vous mène au <em>game over</em> et vous devez recommencer jusqu’à trouver le bon chemin. Dans le cas inverse, <strong>on parlera d’<em>anti-one true path</em>, ou comme je préfère l’appeler, de design <em>always forward</em></strong>, où le <em>game over</em> n’existe pas, et où l’histoire avance toujours, quelles que soient les décisions, bonnes ou mauvaises, prises par les joueurs et joueuses.</p>\n<p>C’est le cas de <em>Vampire: The Masquerade - Swansong</em>, du studio Bordelais Big Bad Wolf, sorti en 2022. Dans ce jeu on incarne à tour de rôle trois vampires qui doivent naviguer dans les intrigues de cour du monde des ténèbres. Le <em>gameplay</em> se divise (en gros) en deux parties : des phases d’exploration pour tenter de découvrir des indices, et des phases de dialogue où l’on doit gérer ses ressources de pouvoir et où tous les coups sont permis pour arriver à ses fins. Il faut faire preuve de beaucoup de prudence, <strong>car chaque joute verbale peut avoir des conséquences désastreuses.</strong></p>\n<p><a href=\"https://example.com/img/lTqCrkE-4N-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/lTqCrkE-4N-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/lTqCrkE-4N-1920.webp 1920w\"><img alt=\"Screenshot du jeu pendant une phase de dialogue. On peut utiliser son pouvoir d'intimidation pour faire plier son interlocuteur.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/lTqCrkE-4N-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<h2 id=\"la-strategie-de-l-echec\" tabindex=\"-1\">La stratégie de l’échec <a class=\"header-anchor\" href=\"https://example.com/blog/vampire/\">#</a></h2>\n<p>Un chapitre de <em>Swansong</em> nous fait incarner Emem qui doit convaincre deux chefs anarchs de s’allier avec le Prince de la ville, leur rival naturel. J’ai mené sans encombre les négociations, teintées de trahison et d’infiltration. C’était pour moi une réussite du point de vue du <em>gameplay</em>, et pourtant <strong>cette réussite a eu des conséquences désastreuses</strong> d’un point de vue scénaristique, entraînant la mort d’autres personnages et pas mal de chaos.</p>\n<p>Il y a donc un fort contraste entre le sentiment de satisfaction après une phase de gameplay réussie, et un sentiment de danger et d'horreur face au déroulement des événements qui nous échappent. Pourquoi ne pas simplement donner un dénouement heureux à la séquence de jeu que l'on vient de passer avec brio ? Cela peut paraître contre-intuitif, mais il est nécessaire pour la dramaturgie que les <strong>personnages</strong> échouent, ou tout du moins soient mis en difficulté, en dépit des phases de jeu réussies.</p>\n<p>En effet, selon les règles communément admises de l'écriture dramatique, <strong>les protagonistes doivent être confrontés à l’adversité</strong>, en particulier au milieu de l’histoire. Dans une structure hollywoodienne classique, les événements doivent tourner en la défaveur des héros pour que leur victoire finale n’en soit que plus méritante. Indiana Jones ou Ethan Hunt se font dérober l’objet de leur quête au milieu du film pour augmenter le sentiment d’urgence de l’histoire, Loki échappe aux Avengers à la moitié du film pour mieux préparer l’affrontement final.<a id=\"back-note-2\"><a href=\"https://example.com/blog/vampire/\">²</a></a></p>\n<p>Il y a donc nécessité, pour le bien de la dramaturgie, que les personnages d'un jeu vidéo soient mis en difficulté dans l’histoire, et ce, même dans l’éventualité où l'on joue le jeu à la perfection. Ces événements fâcheux pour mon personnage m’ont laissé un sentiment très positif : ils  ne sanctionnaient pas une réussite ou un échec, mais un choix que j’avais fait, celui de soutenir Yardley et trahir Cerys. J’avais réussi d’un point de vue <em>gameplay</em> mais mes actions ont mené à une catastrophe. C’était une catastrophe justifiée scénaristiquement, je sentais mon impact dans le monde du jeu et l’histoire était relancée. C’était là une <strong>belle catastrophe</strong>.</p>\n<h2 id=\"prendre-des-coups\" tabindex=\"-1\">Prendre des coups <a class=\"header-anchor\" href=\"https://example.com/blog/vampire/\">#</a></h2>\n<p>L'échec rythme la plupart des jeux du marché. On tombe dans un trou, on se fait tuer par un boss ou par un autre joueur, mais on tire des leçons de nos erreurs et on réessaye. La mécanique de <em>die &amp; retry</em> permet de gommer les échecs pour créer une ligne temporelle où le héros a vaincu sans jamais faillir. Les morts innombrables et les missions échouées sont pour les joueurs et joueuses, pas pour les personnages. Or, dans un jeu <em>always forward</em>, il n’est pas question de remonter le temps pour réparer ses erreurs (à part à recharger sa sauvegarde, ce qui est très contraignant dans <em>Swansong</em>). <strong>On doit vivre avec ses échecs.</strong></p>\n<p>Le jeu vidéo n’est pas fait que de catastrophes qui mènent au <em>game over</em>. Les parties sont rythmées par une myriade de petits échecs : rater un saut, prendre un mauvais chemin, se faire doubler lors d’une course, prendre un coup et perdre un point de vie… Ces revers sont autant de péripéties créant de la tension et apportent de l’enjeu. Le coup de force de <em>Swansong</em> est de recréer ces petits échecs dans un jeu essentiellement composé de dialogues. Durant la plupart des interactions avec des personnages non joueurs, il est possible d’essayer de leur soutirer des informations ou de les convaincre de nous aider en usant de nos pouvoirs. On ne parvient cependant pas toujours à nos fins et on doit avancer en assumant de s'être fait rembarrer par un vampire un peu trop coriace pour nous. Certains moments aux enjeux plus importants sont appelés <strong>« Confrontations »</strong> (comme les négociations évoquées plus haut) et affichent une interface qui permet de littéralement compter les défaites et les victoires durant l’échange. Utilisez le mauvais argument, ratez un jet de persuasion ou de domination mentale, et vous ferez un pas de plus vers un échec de la confrontation. <strong>C’est l’équivalent narratif de prendre un coup.</strong>  Cela fonctionne terriblement bien pour installer un climat de tension tout en microdosant l’échec. On nous fait voir arriver la catastrophe indélébile, alors on essaye de naviguer au mieux dans nos décisions pour l’éviter.</p>\n<p><a href=\"https://example.com/img/sMEdyLYieq-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/sMEdyLYieq-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/sMEdyLYieq-1920.webp 1920w\"><img alt=\"Screenshot du jeu pendant une phase de dialogue. On voit l'échec de la confrontation clairement indiqué sur l'interface.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/sMEdyLYieq-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<h2 id=\"ce-qui-ne-tue-pas\" tabindex=\"-1\">Ce qui ne tue pas… <a class=\"header-anchor\" href=\"https://example.com/blog/vampire/\">#</a></h2>\n<p>En nous refusant la mort, le <em>always forward</em> nous retire le super-pouvoir communément admis de corriger et apprendre de nos erreurs. Comme des vampires, nous devons avancer, incapables de mourir, en assumant nos choix, nos échecs, amassant des regrets. Comment alors créer un jeu narratif palpitant et engageant ? L'exemple de <em>Vampire: The Masquerade - Swansong</em> paraît être une bonne réponse : en créant des catastrophes narratives, de belles catastrophes qui augmentent les enjeux, les dangers, et ce, même si on n'échoue pas vraiment en termes de <em>gameplay</em>.</p>\n<p>En parallèle, on peut aussi se poser la question de ce qui équivaut à « prendre des coups » dans notre jeu pour donner au <em>always forward</em> un rythme qui ressemble à celui des autres types de structures. Comment figure-t-on concrètement aux joueurs et joueuses que l'histoire ne tourne pas en leur faveur ? Faire en sorte de bien montrer qu'il y a de bonnes et de mauvaises réponses permet d'aborder les dialogues avec un esprit de stratège et augmenter la tension des confrontations. Et si on ne craint plus la mort, on craint de devoir vivre avec les conséquences d'un choix malavisé.</p>\n<br>\n___\n<p class=\"footer-note\"><a id=\"note-1\">¹</a> Voir la <a href=\"https://www.youtube.com/watch?v=XK8DuYULiso\" target=\"blank\">conférence</a> de FibreTigre au sujet des structures de fictions intéractives. <a href=\"https://example.com/blog/vampire/\">↑</a> \n</p><p class=\"footer-note\"><a id=\"note-2\">²</a> Voir la <a href=\"https://www.youtube.com/watch?v=j56WPBaiPYQ\" target=\"blank\">vidéo</a> de Lessons from the Screenplay sur le sujet. <a href=\"https://example.com/blog/vampire/\">↑</a>\n</p>\n",
			"date_published": "2024-01-19T00:00:00Z"
		}
		
	]
}
