{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "From Atozi",
	"language": "fr",
	"home_page_url": "https://example.com/",
	"feed_url": "https://example.com/feed/feed.json",
	"description": "Narrative design en analyses",
	"author": {
		"name": "Antonin Demeilliez",
		"url": "https://example.com/about-me/"
	},
	"items": [
		{
			"id": "https://example.com/blog/vampire/",
			"url": "https://example.com/blog/vampire/",
			"title": "Vampire Swansong : la belle catastrophe",
			"content_html": "<p><a href=\"https://example.com/img/ezrUc9-MqU-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/ezrUc9-MqU-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/ezrUc9-MqU-1920.webp 1920w\"><img alt=\"Un vampire devant un long couloir qui se termine par une porte sur laquelle figure le signe de la croix.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/ezrUc9-MqU-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<p><strong>On parlemente, on négocie, on essaie, on convainc, et finalement tout part en vrille et des têtes tombent. Il faudra vivre avec. Dans <em>Vampire: The Masquerade - Swansong</em>, échouer peut mener à la catastrophe mais réussir peut mener à… Une belle catastrophe ! Comment le jeu narratif peut-il s'accommoder des échecs et surtout, plus difficilement, comment peut-il s'accommoder de joueurs et joueuses qui ne font que réussir ?</strong></p>\n<h2 id=\"en-avant\" tabindex=\"-1\"><a id=\"back-note-1\"> En avant !</a> <a class=\"header-anchor\" href=\"https://example.com/blog/vampire/\">#</a></h2>\n<p>Les fictions interactives à embranchements comportent des structures qui peuvent facilement être schématisées. Quand elles ne tolèrent pas l’échec ou le mauvais choix, on parle traditionnellement de structure <em>one true path</em><a href=\"https://example.com/blog/vampire/\">¹</a> (comme dans les plus revêches des <em>Livres dont vous êtes le héros</em>). Dans ce cas, la moindre erreur vous mène au <em>game over</em> et vous devez recommencer jusqu’à trouver le bon chemin. Dans le cas inverse, on parlera d’<em>anti-one true path</em>, ou comme je préfère l’appeler, de design <em>always forward</em>, où le <em>game over</em> n’existe pas, et où l’histoire avance toujours, quelles que soient les décisions, bonnes ou mauvaises, prises par les joueurs et joueuses.</p>\n<p>C’est le cas de <em>Vampire: The Masquerade - Swansong</em>, du studio Bordelais Big Bad Wolf, sorti en 2023 sur consoles et PC. Dans ce jeu on incarne à tour de rôle trois vampires qui doivent naviguer dans les intrigues de cour du monde des ténèbres. Le <em>gameplay</em> se décompose (en gros) en deux parties : des phases d’exploration pour tenter de découvrir des indices, et des phases de dialogue où l’on doit gérer ses ressources de pouvoir et où tous les coups sont permis pour arriver à ses fins. Et à ce jeu, il faut bien reconnaître que nos congénères font tout pour nous pourrir la non-vie, et chaque joute verbale peut avoir des conséquences désastreuses.</p>\n<p><a href=\"https://example.com/img/lTqCrkE-4N-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/lTqCrkE-4N-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/lTqCrkE-4N-1920.webp 1920w\"><img alt=\"Screenshot du jeu pendant une phase de dialogue. On peut utiliser son pouvoir d'intimidation pour faire plier son interlocuteur.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/lTqCrkE-4N-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<h2 id=\"la-strategie-de-l-echec\" tabindex=\"-1\">La stratégie de l’échec <a class=\"header-anchor\" href=\"https://example.com/blog/vampire/\">#</a></h2>\n<p>Un chapitre de <em>Swansong</em> nous fait incarner Emem qui doit convaincre deux chefs anarchs, Rafa et Cerys, de s’allier avec le Prince de la ville, leur rival naturel. J’ai mené l’une des négociations, teintée de trahison et d’infiltration, sans encombre. C’était pour moi une réussite du point de vue du <em>gameplay</em>. Et pourtant cette réussite a eu des conséquences désastreuses d’un point de vue scénaristique, entraînant la mort d’autres personnages et pas mal de chaos.</p>\n<p>Bien qu'il s’agisse d’un jeu <em>always forward</em>, il est donc possible d’échouer et d’en subir les conséquences dans <em>Vampire: The Masquerade - Swansong</em>. Cela peut paraître contre-intuitif, mais il est nécessaire pour la dramaturgie que les <strong>personnages</strong> échouent. En effet, selon les règles de base de l’écriture de scénario, les protagonistes doivent être confrontés à l’adversité, en particulier au milieu de l’histoire. Dans une structure hollywoodienne classique, les événements doivent tourner en la défaveur des héros pour que leur victoire finale n’en soit que plus méritante. Indiana Jones ou Ethan Hunt se font dérober l’objet de leur quête au milieu du film pour augmenter le sentiment d’urgence de l’histoire, Loki échappe aux Avengers à la moitié du film pour mieux préparer l’affrontement final.<a id=\"back-note-2\"><a href=\"https://example.com/blog/vampire/\">²</a></a></p>\n<p>Il y a donc nécessité, pour le bien de la dramaturgie, que les personnages soient mis en difficulté dans l’histoire du jeu, et même dans l’éventualité où l'on joue le jeu à la perfection. Ces événements fâcheux pour mon personnage m’ont laissé un sentiment très positif : ils  ne sanctionnaient pas une réussite ou un échec, mais un choix que j’avais fait, celui de soutenir Yardley et trahir Cerys. J’avais réussi d’un point de vue <em>gameplay</em> mais mes actions ont mené à une catastrophe. C’était une catastrophe justifiée scénaristiquement, je sentais mon impact dans le monde du jeu et l’histoire était relancée. C’était là une <strong>belle catastrophe</strong>.</p>\n<h2 id=\"prendre-des-coups\" tabindex=\"-1\">Prendre des coups <a class=\"header-anchor\" href=\"https://example.com/blog/vampire/\">#</a></h2>\n<p>On ne cesse d’échouer dans la plupart des jeux du marché. Les <em>game over</em> y sont nombreux. On tombe dans un trou, on se fait tuer par un boss ou par un autre joueur, mais il est toujours possible de tirer des leçons de ses erreurs et réessayer. La mécanique de <em>die &amp; retry</em> permet de gommer les échecs pour créer une ligne temporelle où le héros a vaincu sans jamais faillir. Les morts innombrables, les missions échouées, sont pour les joueurs et joueuses, pas pour les personnages. Or, dans un jeu <em>always forward</em>, il n’est pas question de remonter le temps pour réparer ses erreurs (à part à recharger sa sauvegarde, ce qui est très contraignant dans <em>Swansong</em>). On doit vivre avec ses échecs.</p>\n<p>Cependant, le jeu vidéo n’est pas fait que de catastrophes qui mènent au <em>game over</em>. Il est fait d’une myriade de petits échecs : rater un saut, prendre un mauvais chemin, se faire doubler lors d’une course, prendre un coup et perdre un point de vie… Ces revers ponctuent la partie de péripéties, créent de la tension et apportent de l’enjeu. Le coup de force de <em>Swansong</em> est de recréer ces petits échecs dans un jeu essentiellement composé de dialogues.</p>\n<p>Durant la plupart des interactions avec des personnages non joueurs, il est possible d’essayer de leur soutirer des informations ou de les convaincre de nous aider en usant de nos pouvoirs. On ne parvient cependant pas toujours à nos fins. Certains moments aux enjeux plus importants sont appelés « Confrontations » (comme les négociations évoquées plus haut) et affichent une interface qui permet de littéralement compter les erreurs et les victoires durant l’échange. Utilisez le mauvais argument, ratez un jet de persuasion ou de domination mentale, et vous ferez un pas de plus vers un échec de la confrontation. C’est l’équivalent narratif de prendre un coup et cela marche terriblement bien pour installer un climat de tension tout en microdosant l’échec. On nous fait voir arriver la catastrophe indélébile, alors on essaye de naviguer au mieux dans nos décisions pour l’éviter.</p>\n<p><a href=\"https://example.com/img/sMEdyLYieq-1920.jpeg\" target=\"_blank\"><picture><source type=\"image/avif\" srcset=\"https://example.com/img/sMEdyLYieq-1920.avif 1920w\"><source type=\"image/webp\" srcset=\"https://example.com/img/sMEdyLYieq-1920.webp 1920w\"><img alt=\"Screenshot du jeu pendant une phase de dialogue. On voit l'échec de la confrontation clairement indiqué sur l'interface.\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/sMEdyLYieq-1920.jpeg\" width=\"1920\" height=\"1080\"></picture></a></p>\n<h2 id=\"ce-qui-ne-tue-pas\" tabindex=\"-1\">Ce qui ne tue pas… <a class=\"header-anchor\" href=\"https://example.com/blog/vampire/\">#</a></h2>\n<p>En nous refusant la mort, le <em>always forward</em> nous retire le super-pouvoir communément admis de corriger et apprendre de nos erreurs. Comme des vampires, nous devons avancer, incapables de mourir, en assumant nos choix, nos échecs, amassant des regrets.\nComment alors créer un jeu narratif palpitant et engageant ? En créant des catastrophes narratives, de belles catastrophes qui augmentent les enjeux, les dangers, et ce, même si on n'échoue pas vraiment en termes de <em>gameplay</em>. Il faut cependant se poser la question de ce qui équivant à « prendre des coups » dans notre histoire, comment on figure concrètement aux joueurs et joueuses que quelque chose de terrible peut et va leur arriver. Et si on ne craint plus la mort, on craint de devoir vivre avec le poids d'un choix malavisé.</p>\n<br>\n___\n<p class=\"footer-note\"><a id=\"note-1\">¹</a> Voir la <a href=\"https://www.youtube.com/watch?v=XK8DuYULiso\" target=\"blank\">conférence</a> de FibreTigre au sujet des structures de fictions intéractives. <a href=\"https://example.com/blog/vampire/\">↑</a> \n</p><p class=\"footer-note\"><a id=\"note-2\">²</a> Voir la <a href=\"https://www.youtube.com/watch?v=j56WPBaiPYQ\" target=\"blank\">vidéo</a> de Lessons from the Screenplay sur le sujet. <a href=\"https://example.com/blog/vampire/\">↑</a>\n</p>\n",
			"date_published": "2024-01-19T00:00:00Z"
		}
		
	]
}
